/*
- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
 попадає число (в першу, другу, третю или четверту частину години).
*/

/*let time = +prompt("Укажите время от 0 до 59");
    if (time >= 0 && time <= 14 ) {
        console.log('Первая четрверть')
    } else if (time >= 15 && time <= 29) {
        console.log('Вторая четверть')
    } else if (time >= 30 && time <= 44) {
        console.log('Третья четверть')
    } else if (time >= 45 && time <= 59) {
        console.log('Четвертая четверть')
    } else {
        console.log("Повторите ввод еще раз");
    }*/


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
// місяця потрапляє це число (у першу, другу чи третю).

/*let day = +prompt("Напишите число месяца от 1 до 31");
    if (day >= 1 && day <= 9) {
        console.log('Первая половина месяца!')
    } else if (day >= 10 && day <= 20) {
        console.log('Вторая половина месяца!')
    } else if ( day >= 21 && day <= 31) {
        console.log('Третья половина месяца!')
    } else  {
        console.log("Повторите ввод еще раз");
    }*/

