/*
- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
 попадає число (в першу, другу, третю или четверту частину години).
*/

/*let time = +prompt("Укажите время от 0 до 59");
    if (time >= 0 && time <= 14) {
        console.log('Первая четрверть')
    } else if (time >= 15 && time <= 29) {
        console.log('Вторая четверть')
    } else if (time >= 30 && time <= 44) {
        console.log('Третья четверть')
    } else if (time >= 45 && time <= 59) {
        console.log('Четвертая четверть')
    } else {
        console.log("Повторите ввод еще раз");
    }*/


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
// місяця потрапляє це число (у першу, другу чи третю).

/*
let day = +prompt("Напишите число месяца от 1 до 31");
    if (day >= 1 && day <= 9) {
        console.log('Первая половина месяца!')
    } else if (day >= 10 && day <= 20) {
        console.log('Вторая половина месяца!')
    } else if ( day >= 21 && day <= 31) {
        console.log('Третья половина месяца!')
    } else  {
        console.log("Повторите ввод еще раз");
    }
*/



/*- У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
    Перевірте роботу скрипта при test, що дорівнює true, false.
    Напишіть два варіанти скрипта - з коротким записом(тернаркою)*/

/*
let test = 'check'
if (test === true) {
    console.log('Верно!')
} else {
    console.log('Не правильно!')
}
*/

/*
let firstTest = false;
let secondTest = false;
let access = firstTest ? "Не правильно" : secondTest ? "Не правильно" : "Верно";
console.log(access);
*/


/*
- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
  Перевірте  скрипт при a, що дорівнює 1, 0, -3
  */


/*let msg = +prompt('Впишите число 1, 0, -3');
if (msg === 0) {
    console.log('Верно')
} else {
    console.log('Не верно')
}*/



/*
- Скласти розклад на тиждень за домопоги switch.
  Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
*/

/*
let weeklySchedule = +prompt('Распорядок недели:');
    switch (weeklySchedule) {
        case 1:
            alert("Понедельник: Занятия онлайн Okten");
    break;
        case 2:
            alert("Вторник: Практика в Киеве Okten");
    break;
        case 3:
            alert("Среда: Занятия онлайн Okten");
    break;
        case 4:
            alert ("Четверг: Практика в Киеве Okten");
    break;
        case 5:
            alert("Пятница: Занятия онлайн Okten");
    break;
        case 6:
            alert("Суббота: Занятия по Английском языку");
    break;
        case 7:
            alert("Воскресенье: Смотреть превью по JavaScript");
    break;
        default:
            alert("Вы ввели какуе-то билебирдятину");

}*/



/*
- Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.*/

/*
let year = +prompt('Год высокосный?')
let myYear = new Date (year, 1, 29).getDate ();
if (myYear == 29) {
    alert('Да')
} else {
    alert('Нет')
}
*/


/*
- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!*/


/*
let title = prompt("Яка «офіційна» назва JavaScript?")
if (title === "ECMAScript") {
    alert("Правильно!")
} else {
    alert("Не знаєте? ECMAScript!")
}*/
